<?php
return [
// Common

// Menu
        "menu_course" => " Курстар",
"menu_login" => " Кіру",
"menu_register" => " Тіркеу",
"menu_cabinet" => " Кабинет",
"menu_logout" => " Шығу",
"menu_base" => " Студенттер базасы",
"menu_review" => " Пікірлер",
"menu_resume"=> " Түйіндемені жүктеу",
"menu_links" => " Сілтемелер",
"menu_map" => " Карта",





//Main

"main_title" => " JANARU жобасы",
"main_subtitle" => "Казіргі заманның сұранысқа ие мамандықтары бойынша базалық білімнің онлайн-курстары",

// Course
"course_title" =>"Барлық оқу бағдарламалары",
"course_subtitle" => " Оқу курсын таңдаңыз",
"video_title" => " Барлық оқу бағдарламалары",
"video_subtitle" => " Оқу курсын таңдаңыз",
"review_title" => " Пікірлер",
"review_subtitle" => "Біздің студенттердің пікірлері",

//Login

"login_text" => " Кіру бастау үшін",
"login" => " Кіру",
"remember_me"=> " Мені Есте сақта",
"forget"=> " Парольді ұмыттыңыз",
"register" => " Тіркелу",
"start"=> " Курсты бастау",
"read_more" => " Толығырақ",
"copyright"=>"Барлық құқықтар қорғалған",
"address"=>"Мекен жайы",
"reset_password"=>"Құпиясөзді қалпына келтіру",
"reset"=>"Қалпына келтіру",
"not_important"=>"Толтыру міндетті емес",
    "resume"=>"ТҮЙІНДЕМЕ",
 "resume_title"=>"Сізге түйіндеме үлгісін жүктеп, оны толтырып, электронды мекенжайға жіберу қажет:",
    "resume_subtitle"=>"хаттың тақырыбында міндетті түрде 'Janaru жобасына қатысушының түйіндемесін' көрсетуіңізді сұраймыз",
"download"=>"Жүктеу",
    "add_review"=>"Пікір қалдыру"



];
