<?php
return [
    "success" => " сәтті аяқталды",
    "created" => " сәтті құрылды",
    "updated"=> " сәтті жаңартылды",
    "deleted"=> " сәтті жойылды",
    "failed"=> " Бір нәрсе дұрыс болмады, кейінірек көріңіз",
    "404" => " Сұраныс бойынша ештеңе табылған жоқ",





    "register_error" => "тіркеу кезінде бірдеңе дұрыс болмады, кейінірек көріңіз немесе Қолдау қызметіне хабарласыңыз",
    "email_error" => "пошта қызметінің қатесі",
    "email_success" => "сіздің поштаңызға тіркеуді жалғастыру үшін растау хаты жіберілді",
    "email_confirmed" => " есептік жазба сәтті расталды!",
    "key_expired" => "өкінішке орай, хаттың мерзімі аяқталды, қайта жіберіңіз",
    "password_recovery"=>"құпия сөзді қалпына келтіру үшін жіберілген хат",
    "new_password" => "Пароль сәтті орнатылды",

];
