<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Языковые ресурсы для проверки значений
    |--------------------------------------------------------------------------
    |
    | Последующие языковые строки содержат сообщения по-умолчанию, используемые
    | классом, проверяющим значения (валидатором). Некоторые из правил имеют
    | несколько версий, например, size. Вы можете поменять их на любые
    | другие, которые лучше подходят для вашего приложения.
    |
    */

    'accepted' => ' сіз қабылдауыңыз керек :attribute.',
    'active_url' => '  :attribute жарамсыз URL мекен-жайын қамтиды.',
    'after' => ' нде :attribute үлкен күн болуы керек: күні.',
    'after_or_equal' => ' нде :attribute үлкенірек немесе тең болуы керек :күні.',
    'alpha' => '  :attribute тек әріптерді қамтуы мүмкін.',
    'alpha_dash' => ' :attribute құрамында тек әріптер, сандар, сызықша және төменгі астын сызу болуы мүмкін.',
    'alpha_num' => ' :attribute тек әріптер мен сандарды қамтуы мүмкін.',
    'array' => ' :attribute массив болуы керек.',
    'before' => ' нде :attribute ертерек күн болуы керек: күні.',
    'before_or_equal' => ' нде :attribute ертерек немесе тең болуы керек: күні.',
    'between' => [
        'numeric' => ' :attribute :min және :max арасында болуы керек.',
    'file'=>' :attribute ндегі файл өлшемі :min және :Max Килобайт(A) арасында болуы керек.',
    'string' => '  таңбалар саны :attribute :min және :max арасында болуы керек.',
    'array' => '  элементтер саны :attribute :min және :max арасында болуы керек.',
    ],
    'boolean' => ' :attribute логикалық типтегі мәнге ие болуы керек.',
    'confirmed' => ' :attribute растаумен бірдей емес.',
    'date' => ' :attribute күн емес.',
    'date_equals' => ' :attribute тең күн болуы керек: күні.',
    'date_format' => ' :attribute: format форматына сәйкес келмейді.',
    'different' => ' өрістер :attribute және: other әр түрлі болуы керек.',
    'digits' => ' сандық өрістің ұзындығы :attribute болуы керек: digits.',
    'digits_between' => ' сандық өрістің ұзындығы :attribute :min және :max арасында болуы керек.',
    'dimensions' => ' :attribute жарамсыз кескін өлшемдеріне ие.',
    'distinct' => ' :attribute қайталанатын мәнді қамтиды.',
    'email' => '  :attribute жарамды электрондық пошта мекенжайы болуы керек.',
    'ends_with' => ':attribute келесі мәндердің бірімен аяқталуы керек:: values',
    'exists' => ' үшін таңдалған мән :attribute дұрыс емес.',
    'file' => ' :attribute файл болуы керек.',
    'толтырылған' => ' :attribute міндетті түрде толтырылады.',
    'gt' => [
        'numeric' => ' :attribute үлкенірек болуы керек: мәні.',
    'file' => '  файл өлшемі :attribute үлкенірек болуы керек: мәні Килобайт(а).',
    'string' => '  таңбалар саны :attribute үлкен болуы керек: value.',
    'array' => '  элементтер саны :attribute үлкен болуы керек: мәні.',
    ],
    'gte' => [
        'numeric' => ' :attribute: value немесе одан үлкен болуы керек.',
    'file' => '  файл өлшемі :attribute болуы керек: мәні Килобайт(а) немесе одан да көп.',
    'string' => '  таңбалар саны :attribute болуы керек: мәні немесе одан көп.',
    'array' => '  элементтер саны :attribute болуы керек: мәні немесе одан көп.',
    ],
    'image' => ' :attribute кескін болуы керек.',
    'in' => ' таңдалған мән :attribute қате.',
    'in_array' => ' :attribute: басқа жерде жоқ.',
    'integer' => ' :attribute бүтін сан болуы керек.',
    'ip' => ' :attribute жарамды IP мекенжайы болуы керек.',
    'ipv4' => ' :attribute жарамды IPv4 мекен-жайы болуы керек.',
    'ipv6' => ' :attribute жарамды IPv6 мекен-жайы болуы керек.',
    'json' => ' :attribute JSON жолы болуы керек.',
    'lt' => [
        'numeric' => ' :attribute кішірек болуы керек: мәні.',
    'file' => '  файл өлшемі :attribute кішірек болуы керек: мәні Килобайт(а).',
    'string' => '  таңбалар саны :attribute аз болуы керек: мәні.',
    'array' => '  элементтер саны :attribute аз болуы керек: мәні.',
    ],
    'lte' => [
        'numeric' => ' :attribute: мәні немесе кішірек болуы керек.',
    'file' => '  файл өлшемі :attribute болуы керек: мәні Килобайт(а) немесе одан аз.',
    'string' => '  таңбалар саны :attribute: value немесе одан аз болуы керек.',
    'array' => '  элементтер саны :attribute: value немесе одан аз болуы керек.',
    ],
    'max' => [
        'numeric' => ' :attribute бұдан былай болуы мүмкін емес: max.',
    'file' => '  файл өлшемі :attribute үлкен болмайды: Max Килобайт (a).',
    'string' => '  таңбалар саны :attribute аспауы керек: max.',
    'array' => '  элементтер саны :attribute аспауы керек: max.',
    ],
    'mimes' => ' :attribute келесі түрлердің бірінің файлы болуы керек:: values.',
    'mimetypes' => ' :attribute келесі түрлердің бірінің файлы болуы керек:: values.',
    'min' => [
        'numeric' => ' :attribute кем болмауы керек: мин.',
    'file' => '  файл өлшемі :attribute кем болмауы керек: min Килобайт(а).',
    'string' => '  таңбалар саны :attribute кем болмауы керек: мин.',
    'array' => '  элементтер саны :attribute кем болмауы керек: мин.',
    ],
    'not_in' => ' үшін таңдалған мән :attribute қате.',
    'not_regex' => ' үшін таңдалған формат :attribute қате.',
    'numeric' => ' :attribute сан болуы керек.',
    'password' => ' пароль дұрыс емес.',
    'present' => ' :attribute болуы керек.',
    'regex' => '  :attribute қате форматқа ие.',
    'required' => ' :attribute міндетті түрде толтырылуы керек.',
    'required_if' => ' :attribute міндетті түрде толтыру керек, қашан: басқа тең: мәні.',
    'required_unless' => ' :attribute міндетті түрде толтыру керек, қашан: басқа тең емес: мәндер.',
    'required_with' => ' :attribute міндетті түрде толтыру керек, қашан: мәндер көрсетілген.',
    'required_with_all' => ' :attribute міндетті түрде толтыру керек, қашан :мәндер көрсетілген.',
    'required_without' => ' :attribute міндетті түрде толтыру керек, қашан :values көрсетілмеген.',
    'required_without_all' => ' :attribute міндетті түрде толтырылуы керек, егер :мәндер көрсетілмеген болса.',
    'Sam' => ' мәндері :attribute және: other сәйкес келуі керек.',
    'size' => [
        'numeric' => ' :attribute тең болуы керек: өлшемі.',
    'file' => '  файл өлшемі :attribute тең болуы керек: өлшемі Килобайт(а).',
    'string' => '  таңбалар саны :attribute тең болуы керек: өлшемі.',
    'array' => '  элементтер саны :attribute тең болуы керек: өлшемі.',
    ],
    'starts_with' => ':attribute келесі мәндердің бірінен басталуы керек:: values',
    'string' => ' :attribute жол болуы керек.',
    'timezone' => ' :attribute жарамды уақыт белдеуі болуы керек.',
    'unique' => ' өрістің мәні :attribute бұрыннан бар.',
    'жүктелген' => ' өрісті жүктеу :attribute сәтсіз аяқталды.',
    'url' => '  :attribute қате URL пішімі бар.',
    'uuid' => ' :attribute дұрыс UUID болуы керек.',

    /*
    |--------------------------------------------------------------------------
    | Собственные языковые ресурсы для проверки значений
    |--------------------------------------------------------------------------
    |
    | Здесь Вы можете указать собственные сообщения для атрибутов.
    | Это позволяет легко указать свое сообщение для заданного правила атрибута.
    |
    | http://laravel.com/docs/validation#custom-error-messages
    | Пример использования
    |
    |   'custom' => [
    |       'email' => [
    |           'required' => 'Нам необходимо знать Ваш электронный адрес!',
    |       ],
    |   ],
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Собственные названия атрибутов
    |--------------------------------------------------------------------------
    |
    | Последующие строки используются для подмены программных имен элементов
    | пользовательского интерфейса на удобочитаемые. Например, вместо имени
    | поля "email" в сообщениях будет выводиться "электронный адрес".
    |
    | Пример использования
    |
    |   'attributes' => [
    |       'email' => 'электронный адрес',
    |   ],
    |
    */

    'attributes' => [
        'name' => 'Аты',
        'username' => 'лақап аты',
        'email' => 'E-Mail адресі',
        'first_name' => 'аты',
        'last_name' => 'Тегі',
        'password' => 'Құпия сөз',
        'password_confirmation' => 'Құпия сөзді Растау',
        'city' => 'Қала',
        'country' => 'Мемлекет',
        'address' => 'Адрес',
        'phone' => 'Телефон',
        'mobile' => ' Моб. нөмірі',
        'age' => 'Жасы',
        'sex' => 'еден',
        'gender' => 'жынысы',
        'day' => 'Күн',
        'month' => 'Ай',
        'year' => 'Жыл',
        'hour' => 'Сағат',
        'minute' => 'минут',
        'second' => 'С',
        'title' => 'атауы',
        'content' => 'Мазмұны',
        'description' => 'Сипаттама',
        'excerpt' => 'ысырма жылдамдығы',
        'date' => 'Күн',
        'time' => 'Уақыт',
        'available' => 'қол жетімді',
        'size' => 'Өлшем',
         "role_id"=> " рөлі",
         "img" => " сурет",
        "status"=>"Мәртебесі",
        "banned"=> " қара тізімде",
        "verified"=>"Верифицирован",
        "not-verified" => " тексерілмеген",
        "non-banned"=> " қара тізімде жоқ",
        "thumbnail" => " алдын ала қарау",
        "subtitle"=>"Подзаголовок",
        "links" => "СІЛТЕМЕЛЕР",
        "author_id" => "Автор",
        "language_id" => "Тіл",
        "word" => "сөз",
        "authors" => " тең авторлар",
        "file" => " Файл",
        "news_id" => " жаңалықтар",
        "alias" => " сілтеме",
        "position" => " Позиция"


        ],
];
