<?php
return[
    //General
    "info"=>"Информация",
    "change"=>"Изменить",
    "edit"=>"Редактировать",
    "delete"=>"Удалить",
    "save"=>"Сохранить",
    "download"=>"Скачать",
    "back"=>"Назад",
    "cancel"=>"Отменить",
    "create"=>"Создать",
    "sure"=>"Вы уверены?",
    "action"=>"Действия",


    //Auth - Login,Register
    "welcome_login"=>"Добро пожаловать! Вход в личный кабинет",
    "email"=>"Email",
    "password"=>"Пароль",
    "same_password"=>"Повторите пароль",
    "remember_me"=>"Запомнить меня",
    "not_signed"=>"Нет учетной записи? Зарегистрируйтесь прямо сейчас",
    "signed"=>"Есть учетная запись? Выполнить вход",
    "login"=>"Вход",
    "forgot"=>"Забыли пароль?",
    "register_message"=>"Создайте учетную запись на нашем портале",
    "name"=>"ФИО",
    "phone"=>"Телефон",
    "register"=>"Зарегистрироваться",
    "i_forgot"=>"Восстановить",
    "recovery_password"=>"Восстановить пароль",

    "id"=>"Порядковый номер",
    "role_id"=>"Роль",
    "main"=>"Главная",
    "users"=>"Пользователи",
    "users_list"=>"Список пользователей",
    "status"=>"Статус",
    "verified"=>"Подтвержден",





];
