<?php


return [
    "success"=>"Успешно выполнено",
    "created"=>"Успешно создано",
    "updated"=>"Успешно обновлено",
    "deleted"=>"Успешно удалено",
    "failed"=>"Упс, что-то пошло не так, попробуйте позже",
    "404"=>"По запросу не было ничего найдено",




    "login_error"=>"Email или пароль не верны!",
    "register_error"=>"При регистрации что-то пошло не так, попробуйте позже, или обратитесь в службу поддержки",
    "email_error"=>"Ошибка почтовой службы",
    "email_success"=>"На вашу почту отправлено письмо с потверждением для продолжения регистрации",
    "email_confirmed"=>"Учетная запись успешно потверждена!",
    "key_expired"=>"К сожалению срок действия письма истек, отправьте заново",
    "password_recover"=>"Отправлено письмо для сброса пароля",
    "new_password"=>"Пароль успешно установлен",


];
